{
  "product":"cloud_portal",
  "contexts":[
    {
      "name":"branding",
      "description":"Common branding information",
      "translatable": false,
      "values":[
        ["{{PRODUCT_NAME}}","VMS Demo Cloud","Name for cloud"],
        ["{{CLOUD_TAB_NAME}}","Cloud","Cloud tab name in thick client"],
        ["{{CLIENT_PROTOCOL}}","demo-vms","URL protocol for calling native clients from browser"],
        ["{{VMS_NAME}}","VMS Demonstration","Name of the VMS customization. Must be short!"],
        ["{{downloadLink}}","http://www.networkoptix.com/live-demo#fulltrial","Emergency link for downloading applications (in case if cloud is down)"],
        ["{{supportLink}}","/content/support",
          "Support link. Use /content/support to use embedded page. If you use phone number here - make sure you format the link correctly like 'tel:...'"],
        ["{{supportLinkText}}","http://support.networkoptix.com","Text to be shown on the support link"],
        ["{{companyUrl}}","http://networkoptix.com","Company main web site"],
        ["{{iOSappID}}","L6FE34GJWM.com.networkoptix.NxMobile","App ID for iOS mobile application"],
        ["{{IOS_APP_LINK}}","disabled","Link for iOS application in Apple AppStore"],
        ["{{ANDROID_APP_LINK}}","disabled","Link for Android application in Google Play"],
        ["{{COMPANY_NAME}}", "Network Optix", "The name of the company itself"],
        ["{{LEGAL_COMPANY_NAME}}", "Network Optix, Inc.", "Legal name of the company (for EULA)"],
        ["{{LEGAL_COMPANY_LOCATION}}", "California", "Location of the company (for EULA)"],
        ["{{LEGAL_COMPANY_JURISDICTION}}", "State of California", "Company's jurisdiction (for EULA)"],
        ["{{LEGAL_COMPANY_COURT}}", "state and federal courts located in Los Angeles County, California", "Court to handle disputes (for EULA)"],
        ["static/images/logo.png", "", "Logo for branding. Height must be equal 64px", "Image", {"height": 64}],
        ["templates/email_logo.png", "",
          "Logo for email. Height must be between 32px and 64px, Width must be between 32px and 200px",
          "Image", {"height_ge": 32, "height_le": 64, "width_le": 200, "width_ge": 32}],
        ["%MAIL_FROM_NAME%", "", "Reserved for future use"],
        ["%MAIL_FROM_EMAIL%", "", "Reserved for future use"]
      ]
    },
    {
      "name": "Landing page",
      "file_path": "static/lang_{{language}}/views/static/landing.html",
      "url": "/content/about",
      "translatable": true,
      "values":[
        ["static/images/promo/cloud.png", "",
          "Image for the front page. Image must have transparent background, recommended height is 200px (that is minimal height).",
          "Image", {"height_ge": 200}],
        ["%SUBTITLE%","Welcome!",
          "One line (50-100 symbols)"],
        ["%BLOCK1_TITLE%","Connect",
          "1-3 words"],
        ["%BLOCK1_CONTENT%","Connect to your Systems with {{PRODUCT_NAME}} account",
          "8-10 words","Long Text"],
        ["%BLOCK2_TITLE%","Share",
          "1-3 words"],
        ["%BLOCK2_CONTENT%","Share the access and manage all your Systems, users and their permissions from a single place",
          "8-10 words","Long Text"],
        ["%BLOCK3_TITLE%","Access",
          "1-3 words"],
        ["%BLOCK3_CONTENT%","No port-forwarding and IP configuration anymore",
          "8-10 words","Long Text"]
      ]
    },
    {
      "name": "Service unavailable page (503)",
      "file_path": "static/503.html",
      "description": "This page is visible if Cloud service is unavailable",
      "url": "/static/503.html",
      "translatable": false,
      "values": [
        ["%BLOCK_CONTENT%", "<h1>{{PRODUCT_NAME}} is under maintenance</h1><p>New better version will be online soon!</p><p>Your {{VMS_NAME}} system is still recording and<br> you can connect there using <a href=\"%DOWNLOAD_LINK%\">our apps</a></p>", "Message about 503 response", "HTML"],
        ["%DOWNLOAD_LINK%", "http://www.networkoptix.com/live-demo#fulltrial", "Emergency link for downloading applications (in case if cloud is down)"],
        ["static/images/503.png","","Image for page. Image goes above text on page", "Image"],
        ["static/images/503@2x.png","","High res image for page. Image goes above text on page", "Image"]
      ]
    },
    {
      "name": "Support page",
      "file_path": "static/lang_{{language}}/views/static/support.html",
      "url": "/content/support",
      "translatable": true,
      "values":[
        ["%CONTENT%", "", "Content for support page", "HTML"]
      ]
    },
    {
      "name": "Eula",
      "description":"End user license agreement",
      "file_path": "static/lang_{{language}}/views/static/eula.html",
      "url": "/content/eula",
      "translatable": true,
      "values":[
        ["%CONTENT%",
          "<p>{{LEGAL_COMPANY_NAME}}</p><p><b>TERMS OF SERVICE</b></p><p><b>IMPORTANT - PLEASE READ CAREFULLY:</b> These Terms of Service (the Agreement) is a legal agreement between {{LEGAL_COMPANY_NAME}}, a {{LEGAL_COMPANY_LOCATION}} corporation (<b>Company</b>) and the customer agreeing to these terms (<b>Customer</b>) and governs Customer's use of the cloud connect service offered by Company (the <b>Service</b>).</p><p>BY CLICKING ON THE I AGREE BUTTON OR USING THE SERVICE, YOU ARE (1)&nbsp;REPRESENTING THAT YOU ARE OVER THE AGE OF 18, (2)&nbsp;REPRESENTING THAT YOU HAVE THE RIGHT AND AUTHORITY TO LEGALLY BIND CUSTOMER, AND (3)&nbsp;CONSENTING TO BE LEGALLY BOUND BY ALL THE TERMS AND CONDITIONS OF THE AGREEMENT. IF YOU DO NOT AGREE TO ALL THESE TERMS OR CANNOT MAKE SUCH REPRESENTATIONS, YOU MAY NOT USE THE SERVICE.</p><p>COMPANY RESERVES THE RIGHT, AT ITS SOLE DISCRETION, TO MODIFY OR REPLACE THIS AGREEMENT AT ANY TIME. IF THE ALTERATIONS CONSTITUTE A MATERIAL CHANGE TO THE AGREEMENT, COMPANY WILL NOTIFY CUSTOMER. WHAT CONSTITUTES A MATERIAL CHANGE WILL BE DETERMINED AT COMPANY'S SOLE DISCRETION, IN GOOD FAITH AND USING COMMON SENSE AND REASONABLE JUDGMENT. CUSTOMER SHALL BE RESPONSIBLE FOR REVIEWING AND BECOMING FAMILIAR WITH ANY SUCH MODIFICATIONS. USE OF THE SERVICE BY CUSTOMER FOLLOWING SUCH NOTIFICATION CONSTITUTES CUSTOMER'S ACCEPTANCE OF THESE TERMS AS MODIFIED. IF ANY MODIFICATION IS NOT ACCEPTABLE TO CUSTOMER, CUSTOMER'S SOLE REMEDY AND RECOURSE IS TO DISCONTINUE USE OF THE SERVICE.</p><p><b>1. DEFINITIONS.</b></p><p><b>1.1.</b> <b>Company Technology</b> means collectively, the Software and any know-how, processes, methodologies, specifications, designs, inventions, functionality, graphics, techniques, methods, applications, user manuals, online documentation, products or other technology and materials of any kind used by Company or its licensors in connection with the performance of the Service or made available by Company to Customer.</p><p><b>1.2.</b> <b>Confidential Information</b> means any and all technical and non-technical information disclosed by one party (<b>Disclosing Party</b>) to the other (<b>Receiving Party</b>), before or after the date hereof, either in writing, orally, by inspection or in any other form or medium, and related to the past, present or future business or technology of the Disclosing Party, including without limitation information constituting or concerning research, development, processes and methodologies; know-how, data, product architecture, designs and specification; software, whether human-readable or machine-readable; product, marketing, sales and business development plans and strategies; competitive analyses; financial analyses and forecasts; cost and pricing data; procurement requirements and vendor information; customers and prospects; licensing and distribution arrangements; the identity, skills and compensation of employees, contractors and consultants; and third party information that the Disclosing Party is permitted to disclose under an obligation to maintain confidentiality. The relationship between the parties and the substance of this Agreement shall also be Confidential Information. The Disclosing Party will mark all Confidential Information in tangible form confidential or proprietary or with words of similar import. Information communicated orally will be considered Confidential Information if the information is identified in writing as being Confidential Information within a reasonable time after the initial disclosure. Regardless of whether so marked or identified, any information that the Receiving Party knew or should have known was considered confidential or proprietary by the Disclosing Party, including without limitation the products and information learned by the Receiving Party upon visual inspection of the Disclosing Party's premises, will be considered Confidential Information of the Disclosing Party's under this Agreement. Confidential Information does not include information, technical data or know-how, which (i)&nbsp;is in the possession of the Receiving Party at the time of disclosure as shown by the Receiving Party's files and records immediately prior to the time of disclosure; (ii)&nbsp;prior or after the time of disclosure becomes part of the public knowledge or literature, not as a result of any inaction or action of the Receiving Party, (iii)&nbsp;is approved for release by the Disclosing Party, or (iv)&nbsp;is independently developed by the Receiving Party without the use of any Confidential Information of the other party.</p><p><b>1.3.</b> <b>Customer Information</b> means all data, information or other content entered by or collected from Customer while accessing and using the Service.</p><p><b>1.4.</b> <b>Software</b> means proprietary software maintained and hosted by Company or its licensors and offered to Customer for use in connection with the Service. Software also includes any Updates provided by Company or its licensors to Customer hereunder.</p><p><b>1.5.</b> <b>Update</b> means the new release of software that includes error corrections and/or minor feature updates.</p><p><b>2. SERVICE.</b></p><p><b>2.1.</b> Subject to the terms and conditions of this Agreement, Company will use commercially reasonable efforts to make available the Service for use by the Customer. The Service is provided to Customer solely for Customer's internal business purposes. Customer's use of the Service shall not include service bureau use, outsourcing, renting, facilities management or time-sharing of the Service or any other use, which would permit any third party to, directly or indirectly, utilize or otherwise benefit from the Service, whether or not for monetary or other consideration.</p><p><b>2.2.</b> Customer shall be responsible for obtaining and maintaining throughout the Term, the internet access and bandwidth (Customer Requirements) necessary to access and use the Service at Customer's facilities. In addition, Customer shall provide adequate access to Customer's premises, personnel and Customer Requirements as is reasonably required for performance of the Service hereunder. Customer acknowledges and agrees that access to Customer Requirements, Customer's facilities and Customer's reasonable cooperation and assistance is essential for the proper and timely performance of the Service.</p><p><b>2.3.</b> Customer shall (i)&nbsp;be responsible for the accuracy, quality and legality of Customer Information and for the means by which Customer acquired Customer Information, and (ii)&nbsp;warrant that Customer Information does not and will not violate third-party rights of any kind, including without limitation any intellectual property rights or rights of publicity and privacy. Company is not responsible for any public display or misuse of Customer Information.</p><p><b>2.4.</b> Customer hereby grants Company a worldwide, non-exclusive, royalty-free license during to use, reproduce, electronically distribute, transmit, have transmitted, perform, display, store, archive, and index Customer Information to provide the Service to Customer.</p><p><b>2.5.</b> Company will have the right to review and monitor all use of the Service to ensure compliance with all of the terms of the Agreement and evaluate performance of the Service. Company will also have the right to analyze user behavior to evaluate use of the Service, both on an individual basis and in the aggregate, and otherwise to collect, create and analyze metadata on an anonymized basis about Customer's and its users' use of the Service provided that such metadata is never disclosed to any third party other than in an anonymized and aggregate format.</p><p>3. SERVICE WARRANTY AND DISCLAIMERS.</p><p><b>3.1.</b> Company warrants that Company shall perform the Service in a workmanlike manner and, in doing so, Company shall use individuals of suitable training and skills consistent with industry standards reasonably applicable to such services.</p><p><b>3.2.</b> EXCEPT AS PROVIDED IN THIS SECTION&nbsp;3, THE SERVICE IS PROVIDED ON AN AS IS BASIS, AND CUSTOMER'S USE OF THE SERVICE IS AT ITS OWN RISK. COMPANY AND ITS LICENSORS MAKE NO OTHER WARRANTY OF ANY KIND, WHETHER EXPRESS, IMPLIED, STATUTORY, OR OTHERWISE RELATING TO THE SERVICE. COMPANY SPECIFICALLY DISCLAIMS ALL IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT, AND WARRANTIES ARISING BY STATUTE OR OTHERWISE IN LAW OR FROM A COURSE OF DEALING OR USE OF TRADE, AS TO ANY MATTER. FURTHERMORE, COMPANY DOES NOT WARRANT THAT THE SERVICE WILL MEET ALL OF CUSTOMER'S REQUIREMENTS, OR THAT THE USE OF THE SERVICE WILL BE UNINTERRUPTED OR ERROR-FREE, OR THAT OPERATION OF THE SERVICE WILL BE SECURE. CUSTOMER ACKNOWLEDGES THAT COMPANY DOES NOT AND CANNOT CONTROL THE FLOW OF DATA OVER THE INTERNET AND SUCH FLOW DEPENDS IN LARGE PART ON THE PERFORMANCE OF INTERNET SERVICES PROVIDED OR CONTROLLED BY THIRD PARTIES ENGAGED BY CUSTOMER. AT TIMES, ACTIONS OR INACTIONS OF SUCH THIRD PARTIES CAN IMPAIR OR DISRUPT CUSTOMER'S USE OF THE SERVICE.</p><p><b>4. SOFTWARE.</b></p><p><b>4.1.</b> Subject to the restrictions and limitations set forth in this Agreement, Company hereby grants to Customer a nonexclusive, nontransferable, limited license, during the Term, to access and use the Software solely to the extent necessary to use the Service in the regular course of Customer's business.</p><p><b>4.2.</b> The license granted under Section&nbsp;4.1 does not include the right to (a)&nbsp;enable any person or entity other than Customer's employees to access and use the Service or Software; (b)&nbsp;modify or create any derivative work based upon the Service or Software; (c)&nbsp;engage in, permit or suffer to continue any unauthorized copying, reselling or distribution of the Service or Software; (d)&nbsp;grant any sublicense or other rights to the Service or Software; (e)&nbsp;reverse engineer, disassemble or decompile all or any portion of, or attempt to discover or recreate the source code for, any Software; or (f)&nbsp;remove, obscure or alter any intellectual property rights notice related to the Software or the Service. Subject to the limited rights expressly granted hereunder, Company reserves all right, title and interest in and to the Software including all related intellectual property rights. No rights are granted to Customer hereunder other than as expressly set forth herein.</p><p><b>5. OWNERSHIP.</b></p><p><b>5.1.</b> All rights, title and interest in and to the Service and Company Technology and any intellectual property rights embodied therein, together with any enhancements, improvements or modifications made thereto, is and shall remain the sole and exclusive property of Company and its licensors, whether created alone or in conjunction with any third party. Except for the rights specifically granted within this Agreement, Customer is granted no other rights in or to the Service or the Company Technology licensed hereunder. Customer shall not obtain any rights, title or interests to Service, Company Technology or any intellectual property rights embodied therein, including any modifications, enhancements, improvements or other alterations made thereto, by virtue of this agreement, operation of law or otherwise.</p><p><b>5.2.</b> Subject only to the limited license expressly granted hereunder, as between Customer and Company, Company acquires no right, title or interest from Customer in or to Customer Information, including any intellectual property rights therein.</p><p><b>6. CONFIDENTIALITY.</b></p><p><b>6.1.</b> The Receiving Party will: (i) not disclose any Confidential Information of the Disclosing Party to any third party at any time without the prior written consent of the Disclosing Party; (ii) not use any Confidential Information of the Disclosing Party for any purpose other than for the purposes set forth in, or in furtherance of the transactions contemplated by this Agreement; and (iii)&nbsp;use all commercially reasonable efforts to prevent unauthorized publication or disclosure by any person of Confidential Information of the Disclosing Party. The Receiving Party further agrees that the Disclosing Party's Confidential Information shall remain the sole property of the Disclosing Party and that it will take all reasonable precautions to prevent any unauthorized disclosure of such Confidential Information by its employees or contractors. No license shall be granted by the Disclosing Party to the Receiving Party with respect to Confidential Information disclosed hereunder unless otherwise expressly provided herein. Moreover, the parties understand the sensitive nature of Confidential Information and the underlying project and agree that no Confidential Information received hereunder shall be disclosed to any employee or contractor not having a need to know the same in connection with the project or in the normal course of the business. Accordingly, the parties agree that none of their respective employees, contractors and vendors shall be given access to the other party's Confidential Information until such employee, contractor or vendor has been informed of the confidentiality obligations of this Agreement and has agreed to be bound by the terms of this Agreement or a similar binding obligation of confidentiality and non-disclosure and restricted use as may be applicable. During and after the Term of the Agreement, Customer and its agents are required to keep all proprietary information, including, but not limited to, Company's vendors, devices, remote monitoring agents and other licenses used to perform its obligations under this Agreement, prices and quotations for any products, services or solutions recommended or provided to Customer, confidential and shall not reveal to any outside party, including, but not limited to, Company's competitors.</p><p><b>6.2.</b> In the event the Receiving Party is required to disclose the Confidential Information of the Disclosing Party pursuant to judicial order, requirement of a governmental agency, or by operation of law, the Receiving Party shall promptly deliver written notice to the Disclosing Party to allow the Disclosing Party to contest the disclosure with such judicial or governmental agency and seek a protective order or waive the Receiving Party's requirements hereunder; <u>provided</u>, that if the Receiving Party is compelled to disclose the Confidential Information of the Disclosing Party, the Receiving Party shall disclose only so much of the Confidential Information as is reasonably required to comply with such judicial order, requirement, or law.</p><p><b>6.3.</b> If either party breaches any of its obligations with respect to confidentiality and unauthorized use of the other party's Confidential Information hereunder, the other party shall be entitled to seek equitable relief to protect its interest therein, including but not limited to, injunctive relief, as well as direct monetary damages notwithstanding anything to the contrary contained herein.</p><p><b>7. FEES AND PAYMENT.</b></p><p><b>7.1.</b> Customer shall pay Company the mutually agreed fees and charges for the Service. Company shall invoice the Customer for such fees and charges, which shall be payable within thirty (30) days of the receipt thereof by Customer. Customer acknowledges that (i)&nbsp;fees are based on services purchased and delivered, and (ii)&nbsp;payment obligations are non-cancelable and not subject to set-off or deduction and fees paid are non-refundable. Customer's obligations under this Agreement are absolute, non-cancelable and shall continue without abatement.</p><p><b>7.2.</b> The charges and fees under this Agreement are exclusive of any national, state, municipal, or other governmental excise, sales, value-added and occupational taxes all of which, if applicable, shall be paid by Customer.</p><p><b>7.3.</b> All billing disputes or requests for billing adjustments must be submitted in writing to the Company accounting department within ten (10) days of the receipt of disputed invoice, accompanied by a reasonably detailed explanation for the basis of such dispute. Payment of all invoiced amounts shall be paid timely, and in no event may Customer withhold any amount due. Company may request additional information or supporting documentation or reject Customer's claim if unverifiable based on Company's records. If Company rejects such claim, Company will notify Customer, in which case no refund or credit shall be due. If Company determines that the disputed portion was erroneously charged or that other credits or adjustments for downtime or failure to comply with service levels are appropriate pursuant to the terms and conditions of this Agreement, Company will notify Customer of such determination and will credit Customer's invoice for such amount in the next appropriate billing cycle and Customer may withhold payment of the credited amount from such invoice.</p><p><b>7.4.</b> Company may suspend Service immediately and without notice if Customer's account with Company is or becomes past due. In addition to any rights and remedies available to Company hereunder, at law, or in equity, if Customer fails to pay any fees due hereunder within ten (10) days from the date due, Company may impose a late charge equal to the maximum allowable under applicable law. Customer shall be liable for any costs and expenses, including any and all attorneys' fees, incurred by Company in collecting any amounts due and payable hereunder.</p><p><b>8. TERM; TERMINATION; EFFECT OF TERMINATION.</b></p><p><b>8.1.</b> The term of this Agreement will commence from the date of installation and continue until terminated in accordance with Section&nbsp;8.2 below (the Term).</p><p><b>8.2.</b> This Agreement may be terminated by either party upon thirty (30) days' prior written notice for any or no reason.</p><p><b>8.3.</b> Upon the termination of the Agreement, the following will apply: (a)&nbsp;any license rights granted to Customer with respect to the Service and/or Company will terminate as of the effective date of the termination; (b)&nbsp;each party will return to the other party any and all Confidential Information of the other party in its possession or control; and (c)&nbsp;Company will have no obligation to provide the Service to Customer after the effective date of the termination. Notwithstanding the expiration or termination of this Agreement for any reason, Sections&nbsp;3.2, 5, 6, 8.3, 9, 10 and 14 will survive any termination of this Agreement.</p><p><b>9. INDEMNIFICATION.</b></p><p><b>9.1.</b> Company will indemnify, defend and hold Customer harmless from and against all demands, claims, actions, losses, damages, liabilities, costs and expenses, including, without limitation, costs of investigation and defense and reasonable attorneys' fees and expenses, asserted against, imposed upon, incurred or to be incurred by Customer in connection with claims by a third party, which result from or are based on (i)&nbsp;a claim that the Service, as provided by Company, infringe the copyright or misappropriate the trade secrets of such third party, or (ii)&nbsp;Company's gross negligence or willful misconduct.</p><p><b>9.2.</b> Except for claims covered under Company's indemnification obligations under Section&nbsp;9.1 above, Customer will indemnify, defend and hold Company harmless from and against all demands, claims, actions, losses, damages, liabilities, costs and expenses, including, without limitation, costs of investigation and defense and reasonable attorneys' fees and expenses, asserted against, imposed upon, incurred or to be incurred by Company in connection with claims by a third party which result from or are based on (i)&nbsp;any use of the Service by Customer, (ii)&nbsp;Customer's gross negligence or willful misconduct, or (iii)&nbsp;Customer's failure to comply with Applicable Laws.</p><p><b>9.3.</b> The indemnification obligations of each party are dependent on the party seeking indemnity (a)&nbsp;giving the indemnifying party prompt written notice of such claim, (b)&nbsp;permitting the indemnifying party to defend or settle the claim, (c)&nbsp;not making any admission of liability in respect of the whole or any part of the claim or entering into any agreement or negotiation to settle or dispose of the claim, (d)&nbsp;providing all reasonable assistance to the indemnifying party in defending or settling the claim, and (e)&nbsp;the claim shall not have arisen due to unauthorized acts or misconduct of the other party or a third party, acting on behalf of such other party.</p><p><b>10.</b> <b>LIMITATIONS ON LIABILITY; BASIS OF BARGAIN.</b> IN NO EVENT WILL COMPANY OR ITS LICENSORS BE LIABLE FOR ANY PUNITIVE, EXEMPLARY, SPECIAL, CONSEQUENTIAL OR INCIDENTAL DAMAGES (INCLUDING, WITHOUT LIMITATION, LOSS OF REVENUE, USE, PROFITS, DATA, OR GOODWILL) OR COSTS OF PROCURING SUBSTITUTE PRODUCTS OR SERVICES, ARISING OUT OF, RELATING TO, OR IN CONNECTION WITH THIS AGREEMENT INCLUDING THE USE, OPERATION OR PERFORMANCE OF THE SERVICE OR COMPANY TECHNOLOGY WHETHER SUCH LIABILITY ARISES FROM ANY CLAIM BASED UPON CONTRACT, WARRANTY, TORT (INCLUDING NEGLIGENCE), PRODUCT LIABILITY OR OTHERWISE, WHETHER OR NOT COMPANY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH LOSS OR DAMAGE. COMPANY AND CUSTOMER HAVE AGREED THAT THESE LIMITATIONS WILL SURVIVE AND APPLY EVEN IF ANY LIMITED REMEDY SPECIFIED IN THIS AGREEMENT IS FOUND TO HAVE FAILED OF ITS ESSENTIAL PURPOSE. IN NO EVENT WILL COMPANY'S LIABILITY TO CUSTOMER ARISING OUT OF, RELATING TO, OR IN CONNECTION WITH THIS AGREEMENT, FROM ALL CAUSES OF ACTION AND UNDER ALL THEORIES OF LIABILITY, EXCEED THE FEES PAID BY CUSTOMER TO COMPANY IN THE SIX (6) CALENDAR MONTH PERIOD IMMEDIATELY PRECEDING THE DATE FOR WHICH ANY CLAIM OF LIABILITY IS MADE. CUSTOMER ACKNOWLEDGES THAT (A)&nbsp;COMPANY HAS SET ITS PRICES AND ENTERED INTO THIS AGREEMENT IN RELIANCE UPON THE LIMITATIONS OF LIABILITY AND THE DISCLAIMERS OF WARRANTIES AND DAMAGES SET FORTH HEREIN, AND THAT THE SAME FORM AN ESSENTIAL BASIS OF THE BARGAIN BETWEEN THE PARTIES, AND (B)&nbsp;THE LIMITATION AND EXCLUSIONS OF LIABILITY AND DISCLAIMERS SPECIFIED IN THIS AGREEMENT WILL SURVIVE AND APPLY EVEN IF FOUND TO HAVE FAILED THEIR ESSENTIAL PURPOSE.</p><p><b>11.</b> <b>ASSIGNMENT.</b> Customer may not assign, resell or otherwise transfer any goods or services received under this Agreement to a third party without the prior written consent of Company. Notwithstanding the foregoing, Customer may assign all of its rights and duties under this Agreement to a third party that: (a)&nbsp;directly or indirectly controls Customer; (b)&nbsp;is controlled by or under common control with Customer; or (c)&nbsp;purchases all or substantially all of Customer's assets; provided, that: (i) Customer gives prior written notice to Company of the assignment, and (ii)&nbsp;the assignee agrees to be bound by all the terms of this Agreement. Assignment of this Agreement will not release Customer from any prior outstanding obligation under this Agreement. Subject to the foregoing, this Agreement will inure to the benefit of each party's successors and assigns. Any assignment in violation of this Section&nbsp;11 is null and void.</p><p><b>12.</b> <b>RELATIONSHIP.</b> No agency, partnership, or joint venture is created by this Agreement. &nbsp;The parties are and remain at all times independent contractors and not agents or employees of the other party. Neither party has the authority to act for, bind, or incur any debts or liabilities on behalf of, the other party in any respect whatsoever. Each party will act in good faith and refrain from activities that attempt to induce the other party's employee(s) to leave their employer, or to interfere with the other party's relationship with its employees. The parties agree that during the term of the Agreement, and for a period of twelve (12) months thereafter, neither party will, in any way, directly or indirectly (a)&nbsp;induce or attempt to persuade any employee of the other to quit employment, (b)&nbsp;otherwise interfere with or disrupt the other party's relationship with its employees, or (c)&nbsp;knowingly solicit, entice or hire away any employees of the other party. Nothing in this Section&nbsp;12 prohibits either party from hiring in response to a general solicitation for employment or if approached by the prospective employee without solicitation by the party hiring.</p><p><b>13. FORCE MAJEURE.</b> Company will be excused from performance under this Agreement for any period and to the extent that it is prevented from performing pursuant hereto, in whole or in part, as a result of delays caused by Customer or third parties or an act of God, war, civil disturbance, court order, labor dispute or other cause beyond Company's reasonable control, including without limitation failures or fluctuations in electrical equipment. In addition, the Service may be subject to limitations, delays, and other problems inherent in the use of the Internet and electronic communications. Company is not responsible for any delays, failures, or other damage resulting from such problems. Customer acknowledges that the Service may be affected by numerous factors outside of Company's control.</p><p><b>14. GENERAL TERMS.</b> If any provision of this Agreement is held invalid, illegal, or unenforceable, including, without limitation, as a result of unconscionability or inconsistency with public policy, such provision will be construed so as to come as close as possible to its intended meaning, and the validity, legality, or enforceability of the remaining provisions will in no way be impaired. Under no circumstances will the preprinted terms of any service order or any other terms apply to this Agreement. No waiver of any of the terms or conditions of this Agreement will be binding for any purpose unless made in writing and signed by authorized representatives of both parties and any such waiver will be effective only in the specific instance and for the purpose given. No failure or delay on the part of either of the parties in exercising any right will operate as a waiver, nor will any single or partial exercise by either of the parties of any right preclude any other or further exercise thereof or the exercise of any other right. All notices, consents and approvals under this Agreement must be delivered in writing by overnight delivery with a tracking system, personal delivery, or certified mail, postage pre-paid, to the other party at its address set forth above or at such other address as may be later designated by such party. Notices will be deemed to have been received upon the date of receipt or, in the case of certified mailing, two (2) days after deposit in the mail. This Agreement will be governed by the laws of the {{LEGAL_COMPANY_JURISDICTION}} without regard to conflicts of law principles. All disputes arising under this Agreement must be brought in the {{LEGAL_COMPANY_COURT}}. Each party irrevocably hereby consents to the jurisdiction and venue of any such court in any such action or proceeding. This Agreement constitutes the entire, final and exclusive agreement between the parties regarding the subject matter hereof, and supersede all prior or contemporaneous agreements, understandings, discussions, negotiations and communications, whether written or oral, express or implied.</p>",
          "End user licence agreement.",
          "HTML"]
      ]
    }
  ]
}